# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [3]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

print(cars1.head())
print(cars2.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  18.0          8           307        130    3504          12.0     70
1  15.0          8           350        165    3693          11.5     70
2  18.0          8           318        150    3436          11.0     70
3  16.0          8           304        150    3433          12.0     70
4  17.0          8           302        140    3449          10.5     70

   origin                        car  Unnamed: 9  Unnamed: 10  Unnamed: 11  \
0       1  chevrolet chevelle malibu         NaN          NaN          NaN
1       1          buick skylark 320         NaN          NaN          NaN
2       1         plymouth satellite         NaN          NaN          NaN
3       1              amc rebel sst         NaN          NaN          NaN
4       1                ford torino         NaN          NaN          NaN

   Unnamed: 12  Unnamed: 13
0          NaN          NaN
1          NaN          NaN
2          NaN          NaN
3          NaN          NaN
4          NaN          NaN
    mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0  33.0          4            91         53    1795          17.4     76
1  20.0          6           225        100    3651          17.7     76
2  18.0          6           250         78    3574          21.0     76
3  18.5          6           250        110    3645          16.2     76
4  17.5          6           258         95    3193          17.8     76

   origin                 car
0       3         honda civic
1       1      dodge aspen se
2       1   ford granada ghia
3       1  pontiac ventura sj
4       1       amc pacer d/l

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [4]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino

### Step 5. What is the number of observations in each dataset?

In [5]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [19]:
cars = cars1.append(cars2)
print(cars)

      mpg  cylinders  displacement horsepower  weight  acceleration  model  \
0    18.0          8           307        130    3504          12.0     70
1    15.0          8           350        165    3693          11.5     70
2    18.0          8           318        150    3436          11.0     70
3    16.0          8           304        150    3433          12.0     70
4    17.0          8           302        140    3449          10.5     70
..    ...        ...           ...        ...     ...           ...    ...
195  27.0          4           140         86    2790          15.6     82
196  44.0          4            97         52    2130          24.6     82
197  32.0          4           135         84    2295          11.6     82
198  28.0          4           120         79    2625          18.6     82
199  31.0          4           119         82    2720          19.4     82

     origin                        car
0         1  chevrolet chevelle malibu
1         1          buick skylark 320
2         1         plymouth satellite
3         1              amc rebel sst
4         1                ford torino
..      ...                        ...
195       1            ford mustang gl
196       2                  vw pickup
197       1              dodge rampage
198       1                ford ranger
199       1                 chevy s-10

[398 rows x 9 columns]

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [10]:

nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([46164, 15765, 32176, 34346, 41263, 61353, 31144, 61372, 61961,
       44910, 64799, 45555, 53214, 63871, 25000, 38261, 21992, 60820,
       34889, 45110, 49710, 58290, 44466, 33731, 60479, 24901, 19108,
       17410, 20779, 56704, 41738, 26669, 43088, 32394, 66820, 33735,
       40367, 39780, 28447, 32629, 70599, 71999, 30495, 20696, 15717,
       52987, 52485, 29598, 16488, 64094, 44801, 58424, 68302, 51277,
       25348, 30994, 25017, 42275, 52188, 21784, 19153, 71259, 22321,
       54771, 38363, 57304, 18578, 22751, 65268, 29668, 41622, 49577,
       30807, 30156, 17018, 60769, 58039, 46632, 36479, 37226, 37416,
       61584, 69394, 20213, 30542, 38335, 47107, 30571, 23638, 52195,
       18211, 42438, 71603, 46510, 46348, 37842, 49881, 34966, 24952,
       49577, 69480, 35928, 33966, 51471, 27807, 45893, 71046, 23250,
       19060, 68121, 55734, 64832, 46746, 44589, 27104, 71545, 31032,
       23679, 28397, 65931, 17279, 67140, 70284, 22482, 32135, 37359,
       51229, 47372, 20059, 72707, 27148, 26855, 38124, 52608, 48608,
       46889, 37925, 26564, 51907, 53271, 41382, 63477, 52407, 48344,
       24222, 28586, 60985, 34494, 59242, 72671, 19934, 36515, 39208,
       31940, 58751, 31495, 67071, 59543, 33808, 20079, 55258, 28847,
       72081, 68435, 16479, 65742, 46171, 57527, 55888, 23728, 37445,
       60415, 63348, 27270, 58906, 23291, 72369, 62930, 16323, 39033,
       35049, 40329, 25746, 66268, 51961, 39083, 57896, 21930, 67776,
       39035, 42503, 51312, 59841, 57286, 27702, 29106, 45498, 40486,
       47400, 42481, 50277, 70081, 35913, 59394, 45343, 31297, 28852,
       53084, 56944, 49629, 32543, 40983, 42580, 60824, 16800, 68698,
       58866, 62273, 70023, 57371, 22751, 57848, 71679, 16747, 58123,
       41277, 51959, 68608, 61683, 51893, 60594, 29822, 45495, 70091,
       54957, 64850, 60912, 24467, 22255, 25097, 54706, 41642, 66321,
       40710, 32619, 16146, 27449, 48921, 22564, 19468, 68838, 63261,
       63600, 66608, 31236, 41230, 42890, 32070, 58581, 40089, 57701,
       40908, 16136, 28367, 50408, 19751, 29283, 64784, 41381, 72487,
       26727, 16192, 60655, 68018, 60684, 34329, 61055, 67161, 43512,
       61082, 32669, 25273, 31325, 66257, 37425, 27083, 44176, 61548,
       49146, 25388, 39418, 15795, 69177, 20155, 48591, 46072, 53143,
       24790, 17327, 48921, 37671, 16398, 20294, 72012, 55899, 52328,
       57237, 35339, 70995, 67991, 69163, 52723, 41265, 58230, 32089,
       64758, 15790, 52147, 56095, 18191, 22844, 25980, 28341, 56309,
       27693, 55811, 65096, 46036, 53135, 69504, 66377, 27770, 71644,
       37541, 58042, 67864, 32060, 57120, 15261, 18488, 58784, 46990,
       47048, 42172, 64311, 20896, 38934, 36814, 21767, 33329, 53722,
       49024, 17230, 65869, 53017, 15031, 29150, 29995, 20545, 42210,
       44835, 28685, 44950, 30972, 46336, 48506, 26572, 52240, 43436,
       44749, 57875, 27085, 60927, 33680, 61496, 54157, 60647, 58926,
       25267, 19761, 39427, 19489, 60388, 31865, 45525, 27091, 53060,
       63182, 57967, 51754, 71055, 25013, 64001, 17259, 47864, 67139,
       24260, 48296])

### Step 8. Add the column owners to cars

In [20]:


cars['owners'] = nr_owners
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl,17259
196,44.0,4,97,52,2130,24.6,82,2,vw pickup,47864
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage,67139
198,28.0,4,120,79,2625,18.6,82,1,ford ranger,24260
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10,48296